FROM node:lts-buster

# 🛠️ ആവശ്യമായ ടൂളുകൾ ഇൻസ്റ്റാൾ ചെയ്യുന്നു (ffmpeg സ്റ്റിക്കർ നിർമ്മാണത്തിന് അത്യാവശ്യമാണ്)
RUN apt-get update && \
  apt-get install -y \
  ffmpeg \
  imagemagick \
  webp && \
  apt-get upgrade -y && \
  rm -rf /var/lib/apt/apt/lists/*

# 📂 വർക്കിംഗ് ഡയറക്ടറി സെറ്റ് ചെയ്യുന്നു
WORKDIR /app

# 📦 ഡിപെൻഡൻസികൾ കോപ്പി ചെയ്യുന്നു
COPY package.json .

# 📥 ഇൻസ്റ്റാളേഷൻ
RUN npm install

# 🚀 ബാക്കി ഫയലുകൾ കൂടി കോപ്പി ചെയ്യുന്നു
COPY . .

# 🏁 ബോട്ട് സ്റ്റാർട്ട് ചെയ്യുന്നു
CMD ["node", "index.js"]
